src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <basedOn>Catalog.Номенклатура</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОснЕдИзмерения</name>
    <type>
      <types>CatalogRef.ЕденицаИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФирмаПроизводитель</name>
    <type>
      <types>CatalogRef.Производители</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдИзмСравнения</name>
    <type>
      <types>CatalogRef.ЕденицаИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КолВоСравнения</name>
    <comment>в кг.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ценность</name>
    <type>
      <types>CatalogRef.Ценность</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦельПлатежа</name>
    <type>
      <types>CatalogRef.Цели</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНоменклатуры</name>
    <type>
      <types>CatalogRef.ГруппаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектПлатежа</name>
    <type>
      <types>CatalogRef.ДомашниеЖивотные</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Места_Объекты</types>
      <types>String</types>
      <types>CatalogRef.Люди</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.Семья</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВРазныхТарах</name>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.ЕденицаИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолВУпак</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Описание</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Свойства</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ДопСвойстваНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ЕденицаИзмерения/ЕденицаИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕденицаИзмерения</name>
  <predefined>
    <items>
      <name>Килограмм</name>
      <description>кг.</description>
    </items>
    <items>
      <name>Литр</name>
      <description>л.</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ЗаполнитьЗначенияСвойств(Объект,Объект.Родитель);

	Если  НЕ ЗначениеЗаполнено(Объект.ОснЕдИзмерения ) Тогда
		Объект.ОснЕдИзмерения = ПодставитьЕдинИзмерения();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПодставитьЕдинИзмерения()
	ЕдПоУмолч = Справочники.ЕденицаИзмерения.НайтиПоНаименованию("шт.");
	Возврат ЕдПоУмолч;
КонецФункции

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	Если Объект.ЕдИзмСравнения = ПредопределенноеЗначение("Справочник.ЕденицаИзмерения.Килограмм") Тогда 
		Если  Объект.КолВоСравнения < 1 Тогда
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения*1000) + " гр."+ " ";
		Иначе
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения) + " кг."+ " ";
		КонецЕсли;
	ИначеЕсли  Объект.ЕдИзмСравнения = ПредопределенноеЗначение("Справочник.ЕденицаИзмерения.Литр") Тогда //л.
		Если  Объект.КолВоСравнения < 1 Тогда
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения*1000) + " мг."+ " ";
		Иначе
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения) + " л."+ " ";
		КонецЕсли;
	КонецЕсли;
	
	Объект.Наименование = ""+ Номенклатура + " " + Объект.ФирмаПроизводитель + ФорматСравнения;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ГруппаНоменклатуры = Объект.Родитель.ГруппаНоменклатуры;
		Объект.ОбъектПлатежа = Объект.Родитель.ОбъектПлатежа;
		Объект.ОснЕдИзмерения = Объект.Родитель.ОснЕдИзмерения;
		Объект.ЕдИзмСравнения = Объект.Родитель.ОснЕдИзмерения;
		Объект.ЦельПлатежа = Объект.Родитель.ЦельПлатежа;
		Объект.Ценность = Объект.Родитель.Ценность;
	КонецЕсли;
//ЗаполнитьЗначенияСвойств(Объект,Объект.Родитель);
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если Объект.ЕдИзмСравнения = ПредопределенноеЗначение("Справочник.ЕденицаИзмерения.Килограмм") Тогда 
		Если  Объект.КолВоСравнения < 1 Тогда
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения*1000) + " гр."+ " ";
		Иначе
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения) + " кг."+ " ";
		КонецЕсли;
	ИначеЕсли  Объект.ЕдИзмСравнения = ПредопределенноеЗначение("Справочник.ЕденицаИзмерения.Литр") Тогда //л.
		Если  Объект.КолВоСравнения < 1 Тогда
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения*1000) + " мг."+ " ";
		Иначе
			ФорматСравнения = " " +  Строка(Объект.КолВоСравнения) + " л."+ " ";
		КонецЕсли;
	КонецЕсли;
	
	Объект.ПолноеНаименование = ""+ Объект.Наименование + " " + Объект.ФирмаПроизводитель + ФорматСравнения;
КонецПроцедуры
